In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression 
from sklearn import metrics

In [33]:
data=pd.read_csv('E:\medical_cost_insurance.csv')

In [34]:
data

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [35]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [36]:
data.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [37]:
data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [38]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [39]:
data.shape

(1338, 7)

In [40]:
data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [41]:
data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [42]:
data['sex'].unique()

array(['female', 'male'], dtype=object)

In [45]:
data['sex']=data['sex'].map({'female':0, 'male':1})

In [46]:
data.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [47]:
data['smoker']=data['smoker'].map({'yes':1, 'no':0})

In [48]:
data.head()

   age  sex     bmi  children  smoker     region      charges
0   19    0  27.900         0       1  southwest  16884.92400
1   18    1  33.770         1       0  southeast   1725.55230
2   28    1  33.000         3       0  southeast   4449.46200
3   33    1  22.705         0       0  northwest  21984.47061
4   32    1  28.880         0       0  northwest   3866.85520

In [49]:
data['region'].unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [50]:
data['region']=data['region'].map({'southwest':1,'southeast':2,'northwest':3,'northeast':4})

In [51]:
data.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       1  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       3  21984.47061
4   32    1  28.880         0       0       3   3866.85520

In [52]:
data.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [54]:
X=data.drop(['charges'],axis=1)

In [55]:
y=data['charges']

In [56]:
y

0       16884.92400
1        1725.55230
2        4449.46200
3       21984.47061
4        3866.85520
           ...
1333    10600.54830
1334     2205.98080
1335     1629.83350
1336     2007.94500
1337    29141.36030
Name: charges, Length: 1338, dtype: float64

In [57]:
from sklearn.model_selection import train_test_split

In [61]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)

y_train

In [69]:
from sklearn.linear_model import LinearRegression
from sklearn.svm import SVR
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import GradientBoostingRegressor

In [71]:
lr=LinearRegression()
lr.fit(X_train,y_train)
svm=SVR()
svm.fit(X_train,y_train)
rf=RandomForestRegressor()
rf.fit(X_train,y_train)
gr=GradientBoostingRegressor()
gr.fit(X_train,y_train)

GradientBoostingRegressor()

In [72]:
y_pred1=lr.predict(X_test)
y_pred2=svm.predict(X_test)
y_pred3=rf.predict(X_test)
y_pred4=gr.predict(X_test)

In [77]:
df1=pd.DataFrame({'Actual':y_test,'Lr':y_pred1,'svm':y_pred2,'rf':y_pred3,'gr':y_pred4})

In [78]:
df1

           Actual            Lr          svm            rf            gr
764    9095.06825   8924.407244  9548.261584  12831.359669  11001.128629
887    5272.17580   7116.295018  9492.515425   5232.905520   5840.174656
890   29330.98315  36909.013521  9648.758701  28319.714640  28001.980112
1293   9301.89355   9507.874691  9555.044136  11250.391882   9745.291602
259   33750.29180  27013.350008  9420.421978  34454.899057  33639.100981
...           ...           ...          ...           ...           ...
109   47055.53210  39116.968669  9648.902852  46997.650750  45431.423211
575   12222.89830  11814.555568  9625.431547  12681.482611  12465.025294
535    6067.12675   7638.107736  9504.168517   6353.933309   6974.336525
543   63770.42801  40959.081722  9605.004594  46606.150274  47862.047791
846    9872.70100  12258.228529  9590.987268   9736.654451  10289.655388

[268 rows x 5 columns]

In [79]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 268 entries, 764 to 846
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Actual  268 non-null    float64
 1   Lr      268 non-null    float64
 2   svm     268 non-null    float64
 3   rf      268 non-null    float64
 4   gr      268 non-null    float64
dtypes: float64(5)
memory usage: 12.6 KB

In [89]:
data={
     'age':40,
      'sex':1,
       'bmi': 40.30,
        'children':4,
         'smoker':1,
            'region':2
}

In [90]:
df1=pd.DataFrame(data,index=[0])

In [91]:
df1

   age  sex   bmi  children  smoker  region
0   40    1  40.3         4       1       2

In [93]:
new_pred=gr.predict(df1)

In [94]:
print(new_pred)

[43931.13613049]

In [95]:
gr=GradientBoostingRegressor()

In [96]:
gr.fit(X,y)

GradientBoostingRegressor()

In [97]:
import joblib

In [98]:
joblib.dump(gr,'model_joblib_gr')

['model_joblib_gr']

In [100]:
model=joblib.load('model_joblib_gr')

In [102]:
model.predict(df1)

array([42148.361888])